# 1. Используем базовый образ Python.
# Возьмем не "-slim", а полную версию, в ней больше инструментов "из коробки".
# Но даже в ней может не быть gcc, поэтому добавим его установку.
FROM python:3.10

# 2. Устанавливаем системные зависимости, необходимые для компиляции tgcrypto и работы GitPython.
# build-essential - это пакет, который включает в себя компилятор gcc и другие инструменты.
# -y флаг автоматически отвечает "yes" на все вопросы установщика.
RUN apt-get update && apt-get install -y build-essential git

# 3. Устанавливаем рабочую директорию
WORKDIR /app

# 4. Копируем файл с зависимостями
COPY requirements.txt .

# 5. Устанавливаем Python-библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# 6. Копируем остальной код приложения
COPY . .

# 7. Указываем команду для запуска
CMD ["python3", "-m", "heroku"]
